ETL/Catalogs/СчетУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СчетУчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валютный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто6</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто7</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто8</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто9</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто10</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валютный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Субконто</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСубконто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/СчетУчета/Ext/ManagerModule.bsl
//******************************************************************************************
Функция ПолучитьАналитикуСчета(КодСчета, ТипБазы, База = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	
	Реквизиты			 = "";
	КоличествоСубконто	 = Метаданные.Справочники.СчетУчета.ТабличныеЧасти.Аналитика.Реквизиты.Количество() - 1;
	
	Для А = 1 По КоличествоСубконто Цикл 
		
		Реквизиты = Реквизиты + "Аналитика.Субконто" + А + " КАК Субконто" + А + ",";
		
	КонецЦикла;

	Запрос.Текст = "ВЫБРАТЬ
	|	&Реквизиты
	|ИЗ
	|	Справочник.СчетУчета.Аналитика КАК Аналитика
	|ГДЕ
	|	Аналитика.Счет = &КодСчета
	|	И Аналитика.Ссылка.Владелец = &ТипБазы";

	Запрос.УстановитьПараметр("ТипБазы",	 ТипБазы);
	Запрос.УстановитьПараметр("КодСчета",	 КодСчета);
	
	Если База <> Неопределено Тогда 
		
		Запрос.Текст = Запрос.Текст + " И Аналитика.Ссылка.База = &База";
		
		Запрос.УстановитьПараметр("База", База);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Реквизиты", Лев(Реквизиты, СтрДлина(Реквизиты) - 1));
	
	Результат = Запрос.Выполнить();
	
	Аналитика = Новый Структура;
	
	Если Результат.Пустой() Тогда 
		
		Возврат Аналитика;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для А = 1 По КоличествоСубконто Цикл 
			
			Если ЗначениеЗаполнено(Выборка["Субконто" + А]) Тогда 
				
				Аналитика.Вставить("Субконто" + А, Выборка["Субконто" + А]);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Аналитика;
	
КонецФункции
//******************************************************************************************
Функция ПолучитьСчет(КодСчета, ТипБазы, База = Неопределено) Экспорт 

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	|	СчетПлана.Счет КАК Счет,
	|	СчетПлана.Ссылка КАК Ссылка,
	|	СчетПлана.Валютный КАК Валютный,
	|	СчетПлана.Активный КАК Активный,
	|	СчетПлана.Наименование КАК Наименование,
	|	СчетПлана.Количественный КАК Количественный
	|ИЗ
	|	Справочник.СчетУчета.Счета КАК СчетПлана
	|ГДЕ
	|	СчетПлана.Счет = &КодСчета
	|	И СчетПлана.Ссылка.Владелец = &ТипБазы";

	Запрос.УстановитьПараметр("ТипБазы",	 ТипБазы);
	Запрос.УстановитьПараметр("КодСчета",	 КодСчета);
	
	Если База <> Неопределено Тогда 
		
		Запрос.Текст = Запрос.Текст + " И СчетПлана.Ссылка.База = &База";
		
		Запрос.УстановитьПараметр("База", База);
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Счет = Новый Структура("Счет, Ссылка, Активный, Валютный, Наименование, Количественный, Аналитика");
	
	Если Результат.Пустой() Тогда 
		
		Возврат Счет;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Счет, Выборка);

	Счет.Аналитика = ПолучитьАналитикуСчета(КодСчета, ТипБазы, База);
	
	Возврат Счет;
	
КонецФункции
//******************************************************************************************
Функция ПолучитьСчетПоБазе(КодСчета, База) Экспорт
	
	Возврат ПолучитьСчет(КодСчета, База.ТипБазы, База); 
	
КонецФункции
//******************************************************************************************
